[
  {
    "id": "Abstraction_Is_Just_Energy_Minimization",
    "file": "Abstraction_Is_Just_Energy_Minimization.mp3",
    "abstract": "Abstraction understood as reduction rather than simplification, where eliminating degrees of freedom produces stable forms. Connections between computation, beta reduction, energy minimization, predictive coding, and physical systems. Exploration of abstraction as a temporal, thermodynamic process with ethical consequences when applied to people rather than symbols."
  },
  {
    "id": "La_ilusion_del_pensamiento_dual",
    "file": "La_ilusión_del_pensamiento_dual.mp3",
    "abstract": "Rejection of dual-system models of cognition in favor of a single adaptive process operating at different resolutions. Automatic thought as compressed, practiced reasoning rather than a separate faculty. Resolution shifts, habit formation, and implications for understanding intelligence and artificial systems."
  },
  {
    "id": "La_ingenieria_de_la_violencia_mexica",
    "file": "La_ingeniería_de_la_violencia_mexica.mp3",
    "abstract": "Violence treated as a designed system governed by constraints rather than as uncontrolled brutality. Flower Wars as a mechanism for regulating harm through scheduling, spatial boundaries, and capture-oriented objectives. System viability, external mismatch, and the limits of controlled conflict."
  },
  {
    "id": "Nuestra_vara_de_la_dificultad_esta_chueca",
    "file": "Nuestra_vara_de_la_dificultad_está_chueca.mp3",
    "abstract": "Difficulty as a relational property shaped by task, system, prompt, and environment. Abstraction as compilation rather than simplification, and the fragility of expertise when contexts change. Persistent asymmetries between humans and machines and the redistribution of complexity through technology."
  },
  {
    "id": "The_Aztec_Architecture_of_Sustainable_Violence",
    "file": "The_Aztec_Architecture_of_Sustainable_Violence.mp3",
    "abstract": "Sustainable violence as an architectural problem rather than a moral one. Controlled oscillation between conflict and stability through bounded rules, technological restraint, and institutional memory. System collapse when encountering actors who refuse shared constraints."
  },
  {
    "id": "The_Myth_of_Dual_Cognition",
    "file": "The_Myth_of_Dual_Cognition.mp3",
    "abstract": "Cognition modeled as resolution management rather than competing mental systems. Intuition as highly compressed reasoning and deliberation as high-resolution processing. Critique of moralized views of fast and slow thinking, with consequences for how intelligence and learning are evaluated."
  },
  {
    "id": "Why_Chess_Is_Easier_Than_Laundry",
    "file": "Why_Chess_Is_Easier_Than_Laundry.mp3",
    "abstract": "Why formally bounded tasks feel easier than open-ended maintenance despite comparable complexity. The role of prompts, environments, and compiled abstractions in shaping difficulty. Intelligence as the ability to recognize when abstractions fail and to rebuild them under changing conditions."
  },
  {
    "id": "Tecnologia_no_elimina_la_dificultad_solo_la_redistribuye",
    "file": "التكنولوجيا_لا_تلغي_الصعوبة_بل_تعيد_توزيعها.mp3",
    "abstract": "Technology as a mechanism for relocating difficulty rather than removing it. Simplification through abstraction and the hidden accumulation of complexity in infrastructure, labor, and energy use. Ethical questions about accountability when systems obscure where difficulty ultimately lands."
  }
]

